app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = 6  ORDER BY created_at DESC, "posts"."created_at" ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 6
---
  def index
    @posts = Post.timeline(current_user).order(:created_at).page(params[:page]).per(10)

INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "lkaf;lsdkjfsladf';l"], ["user_id", 1], ["created_at", "2015-08-06 19:52:19.252388"], ["updated_at", "2015-08-06 19:52:19.252388"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save