app/controllers/user_steps_controller.rb

  def update
    @user = current_user
    @user.update_attributes(user_params)
---
UPDATE "users" SET "username" = ?, "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "GDOG"], ["first_name", "Goofy"], ["last_name", "Dog"], ["updated_at", "2015-08-10 21:11:02.745629"], ["id", 5]]